# -*- mode: org; fill-column: 78; coding: utf-8; -*-
# Time-stamp: <2022-04-06 11:55:26 krylon>
#
#+TAGS: optimize(o) refactor(r) bug(b) feature(f) architecture(a)
#+TAGS: web(w) database(d) javascript(j)
#+TODO: TODO(t) IMPLEMENT(i) TEST(e) RESEARCH(r) | DONE(d)
#+TODO: MEDITATE(m) PLANNING(p) REFINE(n) | FAILED(f) CANCELLED(c) SUSPENDED(s)
#+PRIORITIES: A G D

* Recovery

** Clocktable
   #+BEGIN: clocktable :scope file :maxlevel 20
   #+CAPTION: Clock summary at [2022-04-06 Mi 11:55]
   | Headline             | Time   |      |      |      |
   |----------------------+--------+------+------+------|
   | *Total time*         | *5:20* |      |      |      |
   |----------------------+--------+------+------+------|
   | Recovery             | 5:20   |      |      |      |
   | \_  Web [1/1]        |        | 1:35 |      |      |
   | \_    DB Maintenance |        |      | 0:14 |      |
   | \_    Graph          |        |      | 1:21 |      |
   | \_      Tooltips     |        |      |      | 0:30 |
   | \_      Locale       |        |      |      | 0:51 |
   | \_  Features [0/1]   |        | 3:45 |      |      |
   | \_    Trend Analysis |        |      | 3:45 |      |
   #+END:
** Questions
** Database [0/0]                                                    :database:
** Web [1/1]                                                            :web:
*** DONE DB Maintenance                                            :database:
    CLOSED: [2022-04-04 Mo 08:28]
    :LOGBOOK:
    CLOCK: [2022-04-04 Mo 08:14]--[2022-04-04 Mo 08:28] =>  0:14
    :END:
*** Graph                                                        :javascript:
**** DONE Tooltips
     CLOSED: [2022-04-03 So 11:57]
     :LOGBOOK:
     CLOCK: [2022-04-04 Mo 08:54]--[2022-04-04 Mo 09:00] =>  0:06
     CLOCK: [2022-04-03 So 11:33]--[2022-04-03 So 11:57] =>  0:24
     :END:
     I would like to display the Notes - if given - in the tooltips.
**** DONE Locale
     CLOSED: [2022-04-04 Mo 09:00]
     :LOGBOOK:
     CLOCK: [2022-04-03 So 13:35]--[2022-04-03 So 14:26] =>  0:51
     :END:
     I would like the datetime values formatted appropriate to the current
     locale. At least in German format.
** Features [0/1]                                                   :feature:
*** RESEARCH Trend Analysis
    :LOGBOOK:
    CLOCK: [2022-04-06 Mi 11:19]--[2022-04-06 Mi 11:54] =>  0:35
    CLOCK: [2022-04-06 Mi 07:29]--[2022-04-06 Mi 08:31] =>  1:02
    CLOCK: [2022-04-05 Di 15:00]--[2022-04-05 Di 16:17] =>  1:17
    CLOCK: [2022-04-05 Di 12:40]--[2022-04-05 Di 12:50] =>  0:10
    CLOCK: [2022-04-05 Di 10:05]--[2022-04-05 Di 10:46] =>  0:41
    :END:
    I am still unsure how I should go about this. But the main point of
    actually using this application is to recognize when I am entering a
    downward spiral, so it would be useful if the app could give me a heads
    up.
    My first idea, I guess, would be to compute a running average for each
    data point over the last ... couple of days? A week?
    And how do I implement that? Ideally, I could do it right at the SQL
    level, but I'd have to read up on SQL window functions.

    [2022-04-06 Mi 07:29]
    Okay, that first part works, now I have to look into /interpreting/ that
    data to see if we're on a downward spiral.
** Bugs                                                                 :bug:
